

    // 팝업 창

    
var memo = [
    {popimg:'chief1.png', title:'초대 김병로', 
        history:[
            '1887. 12. 전북 순창 생 <br>',
            '1913. 메이지(明治)대학 법과 졸업 <br>',
            '1915. 니혼(日本)대학 법과 졸업 <br>',
            '1919. 부산지방법원 밀양지청 판사 <br>',
            '1920. 변호사 개업(서울) <br>',
            '1923. 의열단 사건 변호 <br>',
            '1926. 조선변호사회 회장 선임, 6·10만세운동 사건 변호 <br>',
            '1934. 변호사 자격정지(6개월), 서울 창동에 은거 <br>',
            '1937. 안창호 사건 변호 <br>',
            '1946. 미군정 사법부장 취임 <br>',
            '1948. 대한민국 초대 대법원장, 법전편찬위원회 위원장 <br>',
            '1949. 반민족행위특별조사위원회 특별재판부장 <br>',
            '1957. 대법원장 정년퇴임 <br>',
            '1964. 사망'],
        info:'초대 대법원장으로 취임하여 사법부의 기틀을 다지고, 법전편찬위원장으로서 민법·형법·형사소송법 등 기본 법률안을 기초하였다. 소신 있는 법관, 강직한 공인으로서 자세를 철저히 지켰으며, ‘법조인의 스승’, ‘사법부의 초석’으로 평가받고 있다.'
},
 {popimg:'chief2.png', title:'2대 조용순',
    history:[
        '1898. 2.충남 대덕 생 <br> ',
        '1922. 경성전수학교 졸업 <br> ',
        '1925. 판·검사 특별임용시험 합격 <br> ',
        '1926. 해주지법 재령지청 판사 <br> ',
        '1941. 변호사 개업(해주) <br> ',
        '1945. 대전지방법원장 <br> ',
        '1948. 대구고등법원장 <br> ',
        '1948. 변호사 개업(대구) <br> ',
        '1952. 대구고등법원장 <br> ',
        '1953. 대법관 <br> ',
        '1954. 중앙선거관리위원장 <br> ',
        '1954. 법무부장관(제7대) <br> ',
        '1955. 사정위원회 위원장(현 감사원장) <br> ',
        '1958. 대법원장(제2대) <br> ',
        '1960. 대법원장 퇴임 <br> ',
        '1975. 8.사망'],
    info:' '
    
 },
 {popimg:'chief3.png', title:'3,4대 조진만',
    history:[
        '1903. 10. 경기 인천 생 <br> ',
        '1923. 경성 법학전문학교 졸업 <br> ',
        '1925. 일본 고등문관시험 사법과 합격 <br> ',
        '1926. 경성지방법원 사법관시보 <br> ',
        '1927. 해주지방법원 판사 <br> ',
        '1939. 대구지방법원 부장판사 <br> ',
        '1943. 변호사 개업(서울) <br> ',
        '1951. 법무부 장관(제5대) <br> ',
        '1953. 변호사 개업(서울) <br> ',
        '1961. 대법원장(제3대) <br> ',
        '1964. 대법원장(제4대) <br> ',
        '1968. 대법원장 정년퇴임 <br> ',
        '1979. 2. 사망'],
    info:'가사사건만 전담처리하는 서울가정법원을 창설하였다. 민사·형사소송절차의 증인신문방식을 종래 재판장이 주도하던 직권신문방식에서 당사자에 의한 교호신문제로 바꾸었다. 소송절차에서 판결서 작성을 간소화하고 국한문 혼용이던 민·형사판결서를 한글전용으로 작성하여 재판사무의 전산화를 앞당겼다. 1966년 ‘법복에 관한 규칙’을 제정하여 법관 복식을 정하고 1953년부터 착용한 법복을 개선하였다.'
 },
 {popimg:'chief4.png', title:'5,6대 만복기',
    history:[
        '1913. 12. 서울 생 <br> ',
        '1937. 경성제국대학 법학과 졸업 <br> ',
        '1937. 일본 고등문관시험 사법과 합격 <br> ',
        '1938. 사법관시보 <br> ',
        '1939. 경성지방법원 판사 <br> ',
        '1945. 경성지방법원 부장판사 <br> ',
        '1948. 법무부 검찰국장 겸 대검검사 <br> ',
        '1949. 법무부 법무국장 <br> ',
        '1950. 대통령 비서관 <br> ',
        '1951. 법무부 차관(제5대) <br> ',
        '1952. 서울지방검찰청 검사장 <br> ',
        '1954. 외자구매처 차장 <br> ',
        '1955. 해무청장(초대) <br> ',
        '1955. 검찰총장(제5대) <br> ',
        '1956. 변호사 개업(서울) <br> ',
        '1961. 대법원 판사 <br> ',
        '1963. 법무부 장관(제16대) <br> ',
        '변호사 개업(서울) <br> ',
        '1968. 대법원장(제5대) <br> ',
        '1973. 대법원장(제6대) <br> ',
        '1978. 대법원장 정년퇴임 <br> ',
        '2007. 7. 사망'],
    info:' '
    
 },
 {popimg:'chief5.png', title:'7대 이영섭',
    history:[
        '1919. 11. 경기 양주 생 <br> ',
        '1942. 경성제국대학 법학과 졸업 <br> ',
        '1942. 일본국 고등문관시험 사법과 합격 <br> ',
        '1945. 경성지방법원 판사 <br> ',
        '1950. 서울지방법원 부장판사 <br> ',
        '1960. 이화여자대학교 법정대학장 <br> ',
        '1961. 대법원 판사 <br> ',
        '1979. 대법원장(제7대) <br> ',
        '1981. 대법원장 퇴임 <br> ',
        '2000. 10. 사망'],
    info:'‘말없이 꾸준히 원리원칙대로 일만 해온 소신파’로 평가받고 있다. 『민법총칙』, 『민사소송법 상, 하』,『민법총칙 강의』, 『신 민법대의』,『체계 민사소송법』을 저술하였다.'
 },
 {popimg:'chief6.png', title:'8대 유태흥',
    history:[
        '1919. 11. 충남 홍성 생 <br> ',
        '1948. 일본 간사이(關西)대학 전문부 법과 졸업 <br> ',
        '1948. 제2회 조선변호사시험 합격 <br> ',
        '1949. 변호사 개업 <br> ',
        '1953. 군법무관 <br> ',
        '1957. 대전지법 홍성지원 판사 <br> ',
        '1960. 대전지법 홍성지원장(부장판사) <br> ',
        '1963. 서울 민, 형사지방법원 부장판사 <br> ',
        '1965. 대구고등법원 부장판사 <br> ',
        '1966. 서울고등법원 부장판사 겸 서울형사지법 수석부장판사 <br> ',
        '1973. 서울형사지방법원장 <br> ',
        '1975. 서울고등법원장 <br> ',
        '1977. 대법원 판사 <br> ',
        '1981. 대법원장(제8대) <br> ',
        '1986. 대법원장 퇴임',
        '2005. 1. 사망'],
    info:' '
},
 {popimg:'chief7.png', title:'9대 김용철',
    history:[
        '1924. 12. 경북 성주 생 <br> ',
        '1948. 제3회 조선변호사시험 합격 <br> ',
        '1950. 서울대학교 법과대학 졸업 <br> ',
        '1951. 해군법무관 <br> ',
        '1957. 대구지방법원 판사 <br> ',
        '1961. 서울지방법원 부장판사 <br> ',
        '1968. 서울고등법원 부장판사 <br> ',
        '1973. 춘천지방법원장 <br> ',
        '1975. 대법원 판사 <br> ',
        '1981. 대법원 판사(재임) 및 법원행정처장 <br> ',
        '1986. 대법원장(제9대) <br> ',
        '1988. 대법원장 퇴임 <br> ',
        '2023. 3. 사망'],
    info:'일제강점기에 법률교육을 받지 않고 대법원판사가 된 첫 법조인이다. 즉결심판을 개선하고, 전산실을 설치하여 등기사무 및 소송사무 전산화의 기초를 다졌다.'
 },
 {popimg:'chief8.png', title:'10대 이일규',
    history:[
        '1920. 12. 경남 충무 생 <br> ',
        '1943. 일본 간사이(關西)대학 전문부 법과 졸업 <br> ',
        '1948. 제2회 조선변호사시험 합격 <br> ',
        '1949. 변호사 개업(충무) <br> ',
        '1951. 부산지법 통영지원 판사 <br> ',
        '1957. 대구지방법원 부장판사 <br> ',
        '1959. 대구고등법원 부장판사 <br> ',
        '1964. 전주지방법원장 <br> ',
        '1973. 대법원 판사 <br> ',
        '1986. 변호사 개업 <br> ',
        '1988. 대법원장(제10대) <br> ',
        '1990. 대법원장 정년퇴임 <br> ',
        '2007. 12. 사망'],
    info:'대법원 판사 시절 민청학련 사건, 김철기 국가모독죄 사건, 박세경 변호사 계엄포고령 위반사건, 고영근 목사 긴급조치 제9호 위반사건 등 세칭 공안사건 재판에 무죄 취지의 소수의견을 개진하였다. 1983년 ‘송씨일가 간첩사건’ 상고심에서 피고인에게 고문이 가해졌다는 이유로 무죄를 선고하였다.'
 },
 {popimg:'chief9.png', title:'11대 김덕주',
    history:[
        '1933. 9. 충남 부여 생 <br> ',
        '1956. 제7회 고등고시 사법과 합격 <br> ',
        '1956. 판·검사 특별임용시험 합격 <br> ',
        '1956. 서울대학교 법과대학 졸업 <br> ',
        '1956. 대구지방법원 판사 <br> ',
        '1956. 군법무관 <br> ',
        '1960. 대구지방법원 판사 <br> ',
        '1966. 서울민사지방법원 부장판사 <br> ',
        '1973. 서울고등법원 부장판사 겸 서울민사지법 수석부장판사 <br> ',
        '1977. 춘천지방법원장 <br> ',
        '1980. 법원행정처 차장 <br> ',
        '1981. 대법원 판사 <br> ',
        '1986. 변호사 개업(서울) <br> ',
        '1988. 대법관 <br> ',
        '1990. 대법원장(제11대) <br> ',
        '1993. 대법원장 퇴임 <br> ',
        '2023. 1. 사망'],
    info:'국민에게 편리한 국민의 법원을 목표로 사법민주화를 지향하였다. 사법부 개혁을 제도화하고 법관임용과정에서부터 법원행정 전반에 이르는 사법부의 장기발전계획을 마무리하였다.'
 },
 {popimg:'chief10.png', title:'12대 윤 관',
    history:[
        '1935. 4. 전남 해남 생 <br> ',
        '1958. 연세대학교 법과대학 졸업 <br> ',
        '1958. 제10회 고등고시 사법과 합격 <br> ',
        '1960. 군법무관 임관 <br> ',
        '1962. 광주지방법원 판사 <br> ',
        '1972. 대법원 재판연구관 <br> ',
        '1973. 광주지법 장흥지원장 <br> ',
        '1979. 광주고등법원 부장판사 <br> ',
        '1981. 서울지법 북부지원장 <br> ',
        '1983. 청주지방법원장 <br> ',
        '1986. 대법원 판사 <br> ',
        '1988. 대법관 <br> ',
        '1993. 대법원장(제12대) <br> ',
        '1999. 대법원장 임기만료 퇴임 <br> ',
        '2022. 11. 사망'],
    info:'21세기 사법부의 청사진을 구상하고, 법원의 입법의견 제출권 확보, 법관근무평정제도 도입, 법관윤리강령 제정 등 인사제도 합리화, 제판제도 혁신 등을 내용으로 하는 24개 개혁과제를 제시하였다.'
 },
 {popimg:'chief11.png', title:'13대 최종영',
    history:[
        '1939. 강원도 강릉 생 <br> ',
        '1961. 제13회 고등고시 사법과 합격 <br> ',
        '1965. 부산지방법원 판사 <br> ',
        '1978. 대법원 재판연구관 <br> ',
        '1979. 대전지방법원 홍성지원장 <br> ',
        '1981. 서울고등법원 부장판사 <br> ',
        '1986. 서울지방법원 북부지원장 <br> ',
        '1991. 서울민사지방법원장 <br> ',
        '1992. 대법관 <br> ',
        '1993. 법원행정처장 <br> ',
        '1997. 중앙선거관리위원장 <br> ',
        '1999. 대법원장(제13대) <br> ',
        '2005. 대법원장 임기만료 퇴임'],
    info:'21세기 사법발전계획을 천명하고, 사법발전계획추진위원회를 구성하여 신 민사사건 관리모델을 도입하고 불구속재판 원칙을 확립하였으며 국선변호인 제도를 개선하였다. 법원 내 지역법관제, 법관 서열제 폐지와 단일호봉제 실시, 사법보좌관제, 등기·호적업무 전산화 등 갖가지 제도를 개혁하였다. 사법개혁위원회를 구성하여 법학전문대학원과 법조일원화, 군사법제도 개혁작업에 착수하였다.'
 },
 {popimg:'chief12.png', title:'14대 이용훈',
    history:[
        '1942. 2. 전남 보성 생 <br> ',
        '1962. 제15회 고등고시 사법과 합격 <br> ',
        '1968. 대전지방법원 판사 <br> ',
        '1980. 대법원 재판연구관 <br> ',
        '1981. 사법연수원 교수 <br> ',
        '1981. 서울민사지법 부장판사 <br> ',
        '1982. 법원행정처 조사국장 겸 감사관 <br> ',
        '1985. 광주고법 부장판사 <br> ',
        '1992. 서울지방법원 서부지원장 <br> ',
        '1993. 법원행정처 차장 <br> ',
        '1994. 대법관 <br> ',
        '2004. 정부공직자윤리위원회 위원장 <br> ',
        '2005. 대법원장(제14대) <br> ',
        '2011. 대법원장 임기만료 퇴임'],
    info:'대법원장 재임 시 진보당 재심사건 판결, 긴급조치 1호 위헌 판결을 통해 사법역사를 바로잡고, 법관이 당사자와 직접 대면하는 구술주의, 공판중심주의 재판을 강조하는 등 국민을 섬기는 사법부를 기치로 내걸고 개혁을 추진하였다.'
 },
 {popimg:'chief13.png', title:'15대 양승태',
    history:[
        '1948. 1. 부산 생 <br> ',
        '1970. 제12회 사법시험 합격 <br> ',
        '1973. 군법무관 임관 <br> ',
        '1975. 서울민사지방법원 판사 <br> ',
        '1983. 법원행정처 송무심의관 <br> ',
        '1989. 사법연수원 교수 <br> ',
        '1991. 서울민사지방법원 부장판사 <br> ',
        '1991. 법원행정처 송무국장 <br> ',
        '1993. 부산고등법원 부장판사 <br> ',
        '1994. 법원행정처 사법정책연구실장 <br> ',
        '1999. 서울지방법원 파산수석부장판사 <br> ',
        '2000. 서울지방법원 민사수석부장판사 <br> ',
        '2001. 서울지방법원 북부지원장 <br> ',
        '2002. 부산지방법원장 <br> ',
        '2003. 법원행정처 차장 <br> ',
        '2003. 특허법원장 <br> ',
        '2005. 대법관 <br> ',
        '2011. 대법원장(제15대) <br> ',
        '2017. 대법원장 임기만료 퇴임'],
    info:'‘국민과 소통하는 열린 법원’이라는 기치 아래 사법부에 대한 국민의 신뢰 증진을 위하여 국민과의 소통 강화, 평생법관제를 위한 인사 제도 정비, 사실심 심리절차 강화, 심급제도 운영 개선 등을 추진하였다. 중·장기적 사법정책연구를 위한 사법정책연구원과 도산전문법원인 서울회생법원을 설립하였다.'
 },
 {popimg:'chief14.png', title:'16대 김명수',
    history:[
        '1959. 10. 부산 생 <br> ',
        '1983. 제25회 사법시험 합격 <br> ',
        '1986. 서울지방법원 북부지원 판사 <br> ',
        '1990. 마산지방법원 진주지원 판사 <br> ',
        '1997. 서울고등법원 판사 <br> ',
        '1999. 대법원 재판연구관 <br> ',
        '2002. 수원지방법원 부장판사 <br> ',
        '2004. 서울중앙지방법원 부장판사 <br> ',
        '2008. 특허법원 부장판사 <br> ',
        '2009. 특허법원 수석부장판사 <br> ',
        '2010. 서울고등법원 부장판사 <br> ',
        '2016. 춘천지방법원장 <br> ',
        '2017. 대법원장(제16대) <br> ',
        '2023. 대법원장 임기만료 퇴임'],
    info:'공정하고 충실한 심리를 통해 정의로운 결론에 이르는 ‘좋은 재판’을 목표로 하였다. 법관의 관료화를 방지하기 위하여 고등법원 부장판사 직위제도를 폐지하고 전국법관대표회의 상설화를 추진하였으며, 법원장 후보 추천제, 사법행정자문회의를 신설하여 대법원장에게 집중된 사법행정 권한을 분산하였다. 또한 영상재판 확대, 형사전자소송 추진을 통하여 국민의 사법접근성을 높였으며, 울산가정법원, 수원고등법원, 의정부지방법원 남양주지원, 수원회생법원, 부산회생법원을 순차로 개원하였다.'
 },
]

    
var ind= 0; 
var txt= '';
var total = $('.popmenu li').size(); // 총개 14개

function popchange() {
    $('.pop .popup img').attr('src', './images/content1/history/' + memo[ind].popimg);
    
    txt= '';
        txt+= '<dl>';
        txt+= '<dt>'+memo[ind].title+'</dt>';
        txt+= '<dd>';

         for(var i in memo[ind].history){
            txt+= memo[ind].history[i]+'\n';
         }
        txt+= '</dd>';

        txt+= '<dd>'+memo[ind].info+'</dd>';
        txt+= '</dl>';
        $('.pop .popup .txt').html(txt);
        $('.popup span').text( (ind+1)+'/'+total);
}

$('.pop .popmenu a').click(function(e){
    e.preventDefault();

    ind =$(this).index('.pop .popmenu a');   // 0 1 2 3 ~~
    $('.pop_btn').fadeIn('slow');
    $('.pop .modal_box').fadeIn('fast');
    $('.pop .popup').fadeIn('slow');

    popchange();

});

$('.close_btn, .pop .modal_box').click(function(e){
    e.preventDefault();
    $('.pop .modal_box').fadeOut('fast');
    $('.pop .popup').fadeOut('fast');
    $('.pop_btn').fadeOut('fast');
});

$('pop_btn a').click(function(e){
    e.preventDefault;

    $('.pop .popup').hide().fadeIn('slow');

    if($(this).hasClass('pre')){
        if(ind==0) ind=total;
        ind--;
        popchange();

    }else if($(this).hasClass('next')){
        if(ind==total-1)ind=-1;
        ind++;
        popchange();
    }
})



    // 팝업 창

// var xhr = new XMLHttpRequest();
// var responseObject;

// xhr.onload = function() {
//     responseObject = JSON.parse(xhr.responseText);
// };

// xhr.open('GET', './js/sub1_1.json', true);
// xhr.send(null);

// // 모달
    
//     var newContent= ''; 
//     $('.more_btn2').click(function(e){
//         e.preventDefault();

//         var ind = $(this).index('.more_btn2');

//         $('.more_btn2').fadeIn('fast');

//         newContent:'';
//         newContent+= '<img src = "'+ responseObject.memo[ind].popimg +'" '+ 'alt="">';
//         newContent+= '<p class="popup_title2">'+ responseObject.memo[ind].title +'" '+ 'alt="">';
//         newContent+= '<p class="popup_history2">'+ responseObject.memo[ind].history +'" '+ 'alt="">';
//         newContent+= '<p class="popup_info">'+ responseObject.memo[ind].info +'" '+ 'alt="">';
        
//     })

//     $('close_btn').click(function(e){
//         e.preventDefault();
//         $('.more_btn2').hide();
//     })